//$bucket : এটা আরেকটি মজার মেথট,এই মেথট ব্যবহার করে গ্রুপিং মতো আরো মজার কাজ খূব সহজেই করা যায়।
// নিচে groupBy দিয়ে বলে দেয়া হয়েছে কিসের  উপর ভিত্তি করে এই সর্টিং টা হবে,
//boundaries দিয়ে বলে দেয়া হয়েছে কিসের কতো থেকে কতো বয়স এর সর্টিং করতে হবে
//default দিয়ে বলে দেয়া হয়েছে যদি এইর বাইরে কোন বয়স থাকে তাহলে কি আউটপুট পাঠাতে চাও
//output:দিয়ে বলে দেয়া হয়েছে কি রেজাল্ট হলো।বাকি সব আশা করি তুমি জানো


db.Test.aggregate([
    {$bucket: {
        groupBy:"$age",
        boundaries:[20,40,60],
        default:"Up to 60..The Old mans",
        output:{
           persons:{ $sum: 1},
           name:{$push: "$name"}
        }
        
    }},
    {
        $sort: {count:-1}
    },
    {
        $limit: 2
    },
    {
        $project: {count:1}
    }
])
