// এটা একটু ট্রিকি বাট মজার।যেমন  একটা ওয়েব সাইটে অনেক অনেক user er booking product
//থাকতে পারে। এতো এতো বুকিং প্রোডাক্টের মধ্যে কার কি বুকিং সেটা বের করার একটা পদ্ধতি
//নিচে দেয়া হলো।
//প্রথমে from এটা দ্বারা বোঝাচ্ছে কোন কালেকশনের ইউজার।
//localField: এখানে বলতে হবে ইউজার এর আইডি
//foreignField: এই ইউজার  আইডি মেইন কালেকশনে কি নামে আছে।
//as এটা হলো এখান  থেকে যে এ্যারেটা আসবে সেটা কি নামে সেভ হবে

db.orders.aggregate([
    {
        $lookup: {
            from: "Test",
            localField: "userId",
            foreignField: "_id",
            as: "user"
        }
    }
])
